Terraform Plan:

```
module.virtual_machine.data.oci_identity_availability_domains.ads: Reading...
module.virtual_machine.data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-2220574233]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_identity_compartment.k8s will be created
  + resource "oci_identity_compartment" "k8s" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + defined_tags   = (known after apply)
      + description    = "k8s cluster"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "k8s"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # module.virtual_machine.oci_core_instance.vm["worker1"] will be created
  + resource "oci_core_instance" "vm" {
      + availability_domain                 = "YnJT:EU-FRANKFURT-1-AD-3"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "worker1"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAgEApUVk+sbM7bAiCzuMzE4N3ShweHsoHuhejsUiB4xRqtGsQtkl3VIfDHJ1rFI4F/gLraLJRmnH+BMBHXjrO/+PiYTKsDeIuOYzAAUGVVPd/SSiB3fXAmpPtlHyoFQ4IlpzkhaKro2FBA01d3l1rMwhy5osRj7S3aQaUJ1phMbjWqBswbeM2sHns6cPo5l5zX9HbI0NPSYOnSBiXypQMPq+7T5K8oNW8AC9DcuAy2ps9WwDSJi9tUPOZXdSTalWGdGPzBRrDohK8JwGWcVnMHl7bjNkhMr5dZpZNQOj859qM+K4KzY1m29/4Vh9yUyWKn8Odx1+clBEEesXobGKgriEhEXSUYWpXYlG4JxFNNvonlsIPQ4MxDBSZs3e6s/6MHOzYM+JmlQuBl6OR83AzxLsHD+f0UDmLEY7oLy4VvX8c8kt2a5ql5s9mTQ5ydJCdqvJOMGaz+vHd+V5ueuMm5Ibcq7HzidQb6XROG/hVOR7e0mi7JCqq1tRTB3tcTjOVNZ93MjrBV1f94AnNQP+67lBI3wmItEntUyMD2I26ffcMcmKPLe/aAHD0iJcY5RG/v5zyHKV9tQt59oBJUEpNgPS1qFY98ie5mgwW1EGCxDcd+5RaBWYTo1tGjLONBdchbWGHXEcM58toep3I0e8NlDjE9SewblLR/SEHx4LG6uSxU8= oracle-cloud_2021-09-0"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = (known after apply)
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 1
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq"
          + source_type             = "image"
        }
    }

  # module.virtual_machine.oci_core_instance.vm["worker2"] will be created
  + resource "oci_core_instance" "vm" {
      + availability_domain                 = "YnJT:EU-FRANKFURT-1-AD-3"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "worker2"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAgEApUVk+sbM7bAiCzuMzE4N3ShweHsoHuhejsUiB4xRqtGsQtkl3VIfDHJ1rFI4F/gLraLJRmnH+BMBHXjrO/+PiYTKsDeIuOYzAAUGVVPd/SSiB3fXAmpPtlHyoFQ4IlpzkhaKro2FBA01d3l1rMwhy5osRj7S3aQaUJ1phMbjWqBswbeM2sHns6cPo5l5zX9HbI0NPSYOnSBiXypQMPq+7T5K8oNW8AC9DcuAy2ps9WwDSJi9tUPOZXdSTalWGdGPzBRrDohK8JwGWcVnMHl7bjNkhMr5dZpZNQOj859qM+K4KzY1m29/4Vh9yUyWKn8Odx1+clBEEesXobGKgriEhEXSUYWpXYlG4JxFNNvonlsIPQ4MxDBSZs3e6s/6MHOzYM+JmlQuBl6OR83AzxLsHD+f0UDmLEY7oLy4VvX8c8kt2a5ql5s9mTQ5ydJCdqvJOMGaz+vHd+V5ueuMm5Ibcq7HzidQb6XROG/hVOR7e0mi7JCqq1tRTB3tcTjOVNZ93MjrBV1f94AnNQP+67lBI3wmItEntUyMD2I26ffcMcmKPLe/aAHD0iJcY5RG/v5zyHKV9tQt59oBJUEpNgPS1qFY98ie5mgwW1EGCxDcd+5RaBWYTo1tGjLONBdchbWGHXEcM58toep3I0e8NlDjE9SewblLR/SEHx4LG6uSxU8= oracle-cloud_2021-09-0"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = (known after apply)
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 1
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq"
          + source_type             = "image"
        }
    }

  # module.virtual_network.oci_core_internet_gateway.igw["vcn1"] will be created
  + resource "oci_core_internet_gateway" "igw" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + defined_tags   = (known after apply)
      + display_name   = "vcn_01-igw"
      + enabled        = true
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # module.virtual_network.oci_core_network_security_group.nsg["vcn1"] will be created
  + resource "oci_core_network_security_group" "nsg" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + defined_tags   = (known after apply)
      + display_name   = "vcn_01-nsg"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule1"] will be created
  + resource "oci_core_network_security_group_security_rule" "nsg_rule" {
      + description               = "ssh"
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "185.230.172.74/32"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = false
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 22
              + min = 22
            }
        }
    }

  # module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule2"] will be created
  + resource "oci_core_network_security_group_security_rule" "nsg_rule" {
      + description               = "influxdb"
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "185.230.172.74/32"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = false
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 8086
              + min = 8086
            }
        }
    }

  # module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule3"] will be created
  + resource "oci_core_network_security_group_security_rule" "nsg_rule" {
      + description               = "portainer"
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "185.230.172.74/32"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = false
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 9000
              + min = 9000
            }
        }
    }

  # module.virtual_network.oci_core_route_table.rt["vcn1"] will be created
  + resource "oci_core_route_table" "rt" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + defined_tags   = (known after apply)
      + display_name   = "Default RT for vcn_01"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # module.virtual_network.oci_core_subnet.subnet["subnet1"] will be created
  + resource "oci_core_subnet" "subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.1.1.0/24"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "subnet1"
      + dns_label                  = (known after apply)
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # module.virtual_network.oci_core_vcn.vcn["vcn1"] will be created
  + resource "oci_core_vcn" "vcn" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = "10.1.0.0/16"
      + cidr_blocks                      = (known after apply)
      + compartment_id                   = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "vcn_01"
      + dns_label                        = (known after apply)
      + freeform_tags                    = (known after apply)
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = (known after apply)
      + is_oracle_gua_allocation_enabled = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_public_ip = {
      + worker1 = (known after apply)
      + worker2 = (known after apply)
    }
```

Plan saved to GH artifacts.